app/code/Kensium/Amconnector/etc/amconnector/PaymentSchema.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
               xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
    <soap:Body>
        <GetList xmlns="http://www.acumatica.com/entity/5.30.001/AmconnectorConfig/">
            <entity xsi:type="PaymentMethods">
                <ID xsi:nil="true"/>
                <Delete>false</Delete>
                <Active xsi:nil="true"/>
                <CashAccounts xsi:nil="true"/>
                <Description xsi:nil="true"/>
                <IntegratedProcessing xsi:nil="true"/>
                <MeansofPayment xsi:nil="true"/>
                <PaymentMethodID xsi:nil="true"/>
                <ProcessingCenters xsi:nil="true"/>
                <RequireRemittanceInformationforCashAccount xsi:nil="true"/>
                <UseinAP xsi:nil="true"/>
                <UseinAR xsi:nil="true"/>
            </entity>
            <returnFullEntities>true</returnFullEntities>
        </GetList>
    </soap:Body>
</soap:Envelope>
